import 'package:flutter/material.dart';
import 'package:news_app/models/news_model.dart';
import 'package:news_app/widgets/news_tile.dart';

class NewsList extends StatelessWidget {
  const NewsList({super.key});

  static final List<NewsModel> news = const [
    NewsModel(
      title:
          "بيان تاريخي: \"البرغوث\" يعيد ترتيب فصول التاريخ في كاتالونيا.",
      news:
          "برشلونة  غرفة العمليات العاطفية\n\n"
          "أعلنت مصادر مطلعة في \"وزارة السحر الكروي\" عن وصول طائرة \"الوفاء\" إلى مطار إل برات، "
          "وعلى متنها أعظم من لمس الكرة، ليونيل ميسي، ليعيد كتابة السطر الأجمل في رواية برشلونة التي لم تكتمل فصولها بعد.\n\n"
          "تفاصيل العودة الملحمية:\n"
          "تؤكد التقارير الميدانية أن العشب في ملعب \"الكامب نو\" قد استعاد لونه الأخضر الزاهي فور ملامسة أقدام \"ليو\" لتراب المدينة، "
          "وكأن الأرض كانت في حالة \"بيات شتوي\" طوال فترة غيابه. الخبراء يؤكدون أن القميص رقم (10)، "
          "الذي ظل يتيماً لفترة، قد بدأ بالاشتعال نوراً، معلناً نهاية عصر \"الغربة\" وبداية عصر \"الاستقرار في أحضان العشق\".\n\n"
          "مراسلنا من أمام أسوار النادي ينقل لنا الأجواء:\n"
          "\"لا يمكن وصف المشهد هنا؛ الجماهير لا تهتف بأسماء، بل تذرف دموعاً من الفرح، وكأن الشمس أشرقت من جهة الغرب لتصحح مسار الكون. "
          "عودة ميسي ليست مجرد صفقة انتقال، بل هي استرداد للروح، وإعادة للنبض إلى جسد 'البلاوغرانا' الذي أنهكه الحنين.\"\n\n"
          "وفي النشرة الفنية:\n"
          "يُتوقع أن تشهد المباريات القادمة سيمفونيات موسيقية تُعزف بالأقدام، حيث يعود \"المايسترو\" لضبط إيقاع القلوب، "
          "وتوزيع هدايا التمريرات الحاسمة التي تفتقدها الشباك. الخبراء العاطفيون يحذرون: \"من يشاهد ميسي بقميص البرسا مجدداً، قد يصاب بحالة من الانتشاء الدائم\".\n\n"
          "برشلونة اليوم ليست مجرد مدينة، إنها \"عاصمة النور\" بفضل عودة ملكها.",
      img: "assets/Q2Z3PQ.jpg",
    ),
    NewsModel(
      title:
          "بيان تاريخي: \"البرغوث\" يعيد ترتيب فصول التاريخ في كاتالونيا.",
      news:
          "برشلونة  غرفة العمليات العاطفية\n\n"
          "أعلنت مصادر مطلعة في \"وزارة السحر الكروي\" عن وصول طائرة \"الوفاء\" إلى مطار إل برات، "
          "وعلى متنها أعظم من لمس الكرة، ليونيل ميسي، ليعيد كتابة السطر الأجمل في رواية برشلونة التي لم تكتمل فصولها بعد.\n\n"
          "تفاصيل العودة الملحمية:\n"
          "تؤكد التقارير الميدانية أن العشب في ملعب \"الكامب نو\" قد استعاد لونه الأخضر الزاهي فور ملامسة أقدام \"ليو\" لتراب المدينة، "
          "وكأن الأرض كانت في حالة \"بيات شتوي\" طوال فترة غيابه. الخبراء يؤكدون أن القميص رقم (10)، "
          "الذي ظل يتيماً لفترة، قد بدأ بالاشتعال نوراً، معلناً نهاية عصر \"الغربة\" وبداية عصر \"الاستقرار في أحضان العشق\".\n\n"
          "مراسلنا من أمام أسوار النادي ينقل لنا الأجواء:\n"
          "\"لا يمكن وصف المشهد هنا؛ الجماهير لا تهتف بأسماء، بل تذرف دموعاً من الفرح، وكأن الشمس أشرقت من جهة الغرب لتصحح مسار الكون. "
          "عودة ميسي ليست مجرد صفقة انتقال، بل هي استرداد للروح، وإعادة للنبض إلى جسد 'البلاوغرانا' الذي أنهكه الحنين.\"\n\n"
          "وفي النشرة الفنية:\n"
          "يُتوقع أن تشهد المباريات القادمة سيمفونيات موسيقية تُعزف بالأقدام، حيث يعود \"المايسترو\" لضبط إيقاع القلوب، "
          "وتوزيع هدايا التمريرات الحاسمة التي تفتقدها الشباك. الخبراء العاطفيون يحذرون: \"من يشاهد ميسي بقميص البرسا مجدداً، قد يصاب بحالة من الانتشاء الدائم\".\n\n"
          "برشلونة اليوم ليست مجرد مدينة، إنها \"عاصمة النور\" بفضل عودة ملكها.",
      img: "assets/Q2Z3PQ.jpg",
    ),
    NewsModel(
      title:
          "بيان تاريخي: \"البرغوث\" يعيد ترتيب فصول التاريخ في كاتالونيا.",
      news:
          "برشلونة  غرفة العمليات العاطفية\n\n"
          "أعلنت مصادر مطلعة في \"وزارة السحر الكروي\" عن وصول طائرة \"الوفاء\" إلى مطار إل برات، "
          "وعلى متنها أعظم من لمس الكرة، ليونيل ميسي، ليعيد كتابة السطر الأجمل في رواية برشلونة التي لم تكتمل فصولها بعد.\n\n"
          "تفاصيل العودة الملحمية:\n"
          "تؤكد التقارير الميدانية أن العشب في ملعب \"الكامب نو\" قد استعاد لونه الأخضر الزاهي فور ملامسة أقدام \"ليو\" لتراب المدينة، "
          "وكأن الأرض كانت في حالة \"بيات شتوي\" طوال فترة غيابه. الخبراء يؤكدون أن القميص رقم (10)، "
          "الذي ظل يتيماً لفترة، قد بدأ بالاشتعال نوراً، معلناً نهاية عصر \"الغربة\" وبداية عصر \"الاستقرار في أحضان العشق\".\n\n"
          "مراسلنا من أمام أسوار النادي ينقل لنا الأجواء:\n"
          "\"لا يمكن وصف المشهد هنا؛ الجماهير لا تهتف بأسماء، بل تذرف دموعاً من الفرح، وكأن الشمس أشرقت من جهة الغرب لتصحح مسار الكون. "
          "عودة ميسي ليست مجرد صفقة انتقال، بل هي استرداد للروح، وإعادة للنبض إلى جسد 'البلاوغرانا' الذي أنهكه الحنين.\"\n\n"
          "وفي النشرة الفنية:\n"
          "يُتوقع أن تشهد المباريات القادمة سيمفونيات موسيقية تُعزف بالأقدام، حيث يعود \"المايسترو\" لضبط إيقاع القلوب، "
          "وتوزيع هدايا التمريرات الحاسمة التي تفتقدها الشباك. الخبراء العاطفيون يحذرون: \"من يشاهد ميسي بقميص البرسا مجدداً، قد يصاب بحالة من الانتشاء الدائم\".\n\n"
          "برشلونة اليوم ليست مجرد مدينة، إنها \"عاصمة النور\" بفضل عودة ملكها.",
      img: "assets/Q2Z3PQ.jpg",
    ),
    NewsModel(
      title:
          "بيان تاريخي: \"البرغوث\" يعيد ترتيب فصول التاريخ في كاتالونيا.",
      news:
          "برشلونة  غرفة العمليات العاطفية\n\n"
          "أعلنت مصادر مطلعة في \"وزارة السحر الكروي\" عن وصول طائرة \"الوفاء\" إلى مطار إل برات، "
          "وعلى متنها أعظم من لمس الكرة، ليونيل ميسي، ليعيد كتابة السطر الأجمل في رواية برشلونة التي لم تكتمل فصولها بعد.\n\n"
          "تفاصيل العودة الملحمية:\n"
          "تؤكد التقارير الميدانية أن العشب في ملعب \"الكامب نو\" قد استعاد لونه الأخضر الزاهي فور ملامسة أقدام \"ليو\" لتراب المدينة، "
          "وكأن الأرض كانت في حالة \"بيات شتوي\" طوال فترة غيابه. الخبراء يؤكدون أن القميص رقم (10)، "
          "الذي ظل يتيماً لفترة، قد بدأ بالاشتعال نوراً، معلناً نهاية عصر \"الغربة\" وبداية عصر \"الاستقرار في أحضان العشق\".\n\n"
          "مراسلنا من أمام أسوار النادي ينقل لنا الأجواء:\n"
          "\"لا يمكن وصف المشهد هنا؛ الجماهير لا تهتف بأسماء، بل تذرف دموعاً من الفرح، وكأن الشمس أشرقت من جهة الغرب لتصحح مسار الكون. "
          "عودة ميسي ليست مجرد صفقة انتقال، بل هي استرداد للروح، وإعادة للنبض إلى جسد 'البلاوغرانا' الذي أنهكه الحنين.\"\n\n"
          "وفي النشرة الفنية:\n"
          "يُتوقع أن تشهد المباريات القادمة سيمفونيات موسيقية تُعزف بالأقدام، حيث يعود \"المايسترو\" لضبط إيقاع القلوب، "
          "وتوزيع هدايا التمريرات الحاسمة التي تفتقدها الشباك. الخبراء العاطفيون يحذرون: \"من يشاهد ميسي بقميص البرسا مجدداً، قد يصاب بحالة من الانتشاء الدائم\".\n\n"
          "برشلونة اليوم ليست مجرد مدينة، إنها \"عاصمة النور\" بفضل عودة ملكها.",
      img: "assets/Q2Z3PQ.jpg",
    ),
  ];

  @override
  Widget build(BuildContext context) {
    return SliverList(
      delegate: SliverChildBuilderDelegate((
        context,
        index,
      ) {
        return NewsTile(news: news[index]);
      }, childCount: news.length),
    );
  }
}
